app/controllers/ivacs_controller.rb

  def index
    @ivacs = Ivac.all
---
SELECT "ivacs".* FROM "ivacs"

  def show
    @ivac = Ivac.find(params[:id])
---
SELECT "ivacs".* FROM "ivacs" WHERE "ivacs"."id" = ? LIMIT 1  [["id", "1"]]

  def new
    @ivac = Ivac.new
    @clientes = Cliente.all
    @empresas = Empresa.all
---
SELECT "clientes".* FROM "clientes"
SELECT "empresas".* FROM "empresas"

  def edit
    @ivac = Ivac.find(params[:id])
    @clientes = Cliente.all
    @empresas = Empresa.all
---
SELECT "ivacs".* FROM "ivacs" WHERE "ivacs"."id" = ? LIMIT 1  [["id", "3"]]
SELECT "clientes".* FROM "clientes"
SELECT "empresas".* FROM "empresas"

  def create
    @ivac = Ivac.new(params[:ivac])

    @ivac.total = @ivac.neto_sin_iva + @ivac.no_gravado_exento + @ivac.percepcion_ingresos_brutuos + @ivac.retencion_ingresos_brutos + @ivac.retencion_de_iva + @ivac.retencion_de_ganancias

    respond_to do |format|
      if @ivac.save
---
INSERT INTO "ivacs" ("cliente", "codigo_de_comprobante", "created_at", "empresa", "fecha_de_la_factura", "iva", "neto_sin_iva", "no_gravado_exento", "nro_de_comprobante", "percepcion_ingresos_brutuos", "retencion_de_ganancias", "retencion_de_iva", "retencion_ingresos_brutos", "rubro", "tipo_de_comprobante", "total", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?)

  def update
    @ivac = Ivac.find(params[:id])

    @ivac.total = @ivac.neto_sin_iva + @ivac.no_gravado_exento + @ivac.percepcion_ingresos_brutuos + @ivac.retencion_ingresos_brutos + @ivac.retencion_de_iva + @ivac.retencion_de_ganancias


    respond_to do |format|
      if @ivac.update_attributes(params[:ivac])
---
SELECT "ivacs".* FROM "ivacs" WHERE "ivacs"."id" = ? LIMIT 1  [["id", "3"]]
UPDATE "ivacs" SET "neto_sin_iva" = 0.0, "percepcion_ingresos_brutuos" = 0.0, "retencion_de_iva" = 0.0, "updated_at" = '2012-07-26 17:19:26.603488' WHERE "ivacs"."id" = 3

  def search

    @datee = params[:dateSearch]

    if(@datee)
     @ivacs = Ivac.all(:conditions => { :fecha_de_la_factura => Date.strptime(@datee, '%d/%m/%Y') })
---
SELECT "ivacs".* FROM "ivacs" WHERE "ivacs"."fecha_de_la_factura" = '2012-07-24'